Revit 2024 API
DisciplineTypeId.Architecture Property
 Architecture.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ForgeTypeId Architecture { get; }
Visual Basic
Public Shared ReadOnly Property Architecture As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ Architecture {
	ForgeTypeId^ get ();
}
See Also
DisciplineTypeId Class
Autodesk.Revit.DB Namespace